import React from 'react'
import { Link } from 'react-router-dom'
import imgDeliver from '../../assets/deliver/elean62862 1.jpg'
import icon from '../../assets/deliver/Group 1484.svg'

const Voz = () => {
  return (
    <section className='deliver'>
        <div className='container'>
            <h2 className='deliver__title'>Возврат</h2>
            <ul className='deliver__ul'>
                <li className='deliver__ul-il'><Link to='/Obmen' className='deliver__ul-li'>ОБМЕН</Link></li>
                <li className='deliver__ul-il'><Link to='/' className='deliver__ul-li'>ДОСТАВКА</Link></li>
                <li className='deliver__ul-il'><Link to='/Pay' className='deliver__ul-li'>ОПЛАТА</Link></li>
            </ul>
            <div className='deliver__page'>
              <img className='deliver__page-img' src={imgDeliver} alt="imgDeliver"/>
              <div className='deliver__page-text'>
                <h2 className='deliver__page-title'>КАК ОФОРМИТЬ ВОЗВРАТ</h2>
                <p className='deliver__page-p'>Вы можете вернуть неношеные изделия в течение 14 дней с момента покупки. Должно быть сохранено качество и вид нового изделия, а также сохранен чек, подтверждающий покупку у нас.</p>
                <p className='deliver__page-p'><b>Если вы приобрели изделия в шоуруме</b> в Москве, вернуть их можно также в шоурум, либо отправить курьером по адресу: ул. Новослободская 26, стр.1, 1 подъезд, 2 этаж, офис 223.</p>
                <p className='deliver__page-p'><b>Если вы приобрели товар в интернет-магазине,</b> вернуть его нужно курьером по адресу: ул. Новослободская 26, стр.1, 1 подъезд, 2 этаж, офис 223.<br/>Возврат денежных средств осуществляется после получения и проверки изделий в нашем офисе, в течение 3-5 рабочих дней на карту, с которой была произведена оплата. Обращаем ваше внимание, <b>возврат осуществляется за счет покупателя.</b> </p>
              </div>
            </div>
            <h2 className='deliver__title-two'>ВОПРОСЫ И ОТВЕТЫ</h2>
            <div className='deliver__page-two'>
              <div className='deliver__page-two_blocks'>
                <div className='deliver__page-two_head'>
                  <h2 className='deliver__page-two_title'>ЕСТЬ ЛИ ДОСТАВКА ЗАГРАНИЦУ ?</h2>
                  <span>
                    <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M13.5417 27.0834C15.877 27.0834 18.1283 26.4902 20.1222 25.3795L25.8574 25.8574L25.3795 20.1222C26.4902 18.1283 27.0834 15.877 27.0834 13.5417C27.0834 6.06282 21.0206 0 13.5417 0C6.06282 0 0 6.06282 0 13.5417C0 21.0206 6.06282 27.0834 13.5417 27.0834ZM19.114 22.8333L19.4886 22.6082L22.8926 22.8918L22.6089 19.4879L22.8341 19.1133C23.8374 17.4442 24.375 15.5336 24.375 13.5409C24.375 7.55779 19.5247 2.70754 13.5416 2.70754C7.55854 2.70754 2.70828 7.55779 2.70828 13.5409C2.70828 19.524 7.55854 24.3742 13.5416 24.3742C15.5343 24.3742 17.4449 23.8367 19.114 22.8333ZM13.5421 20.3099C14.2902 20.3099 14.8967 19.7036 14.8967 18.9557C14.8967 18.2078 14.2902 17.6016 13.5421 17.6016C12.7939 17.6016 12.1874 18.2078 12.1874 18.9557C12.1874 19.7036 12.7939 20.3099 13.5421 20.3099ZM12.1876 16.2488H14.8959V14.8947C14.8959 14.898 14.9023 14.8909 14.9168 14.875C14.9523 14.8358 15.0366 14.743 15.1945 14.6177C15.3301 14.5101 15.3722 14.4822 15.7149 14.2649C16.8812 13.5256 17.6043 12.2399 17.6043 10.8322C17.6043 8.5885 15.7854 6.76965 13.5418 6.76965C11.2981 6.76965 9.47925 8.5885 9.47925 10.8322H12.1876C12.1876 10.0843 12.7939 9.47799 13.5418 9.47799C14.2896 9.47799 14.8959 10.0843 14.8959 10.8322C14.8959 11.3025 14.6556 11.7298 14.2648 11.9775C13.8264 12.2555 13.7536 12.3037 13.5113 12.496C12.7059 13.1349 12.1876 13.8962 12.1876 14.8947V16.2488Z" fill="#D1B59A"/>
                    </svg>
                  </span>
                </div>
                <p className='deliver__page-two_p'>
                  Да, доставка заграницу осуществляется курьерской службой до двери. Доставка заграницу оплачивается при оформлении заказа, фиксированная стоимость 1 200₽.
                </p>
              </div>
              <div className='deliver__page-two_blocks'>
                <div className='deliver__page-two_head'>
                  <h2 className='deliver__page-two_title'>КАК ПОДАБРАТЬ СВОЙ РАЗМЕР?</h2>
                  <span>
                    <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M13.5417 27.0834C15.877 27.0834 18.1283 26.4902 20.1222 25.3795L25.8574 25.8574L25.3795 20.1222C26.4902 18.1283 27.0834 15.877 27.0834 13.5417C27.0834 6.06282 21.0206 0 13.5417 0C6.06282 0 0 6.06282 0 13.5417C0 21.0206 6.06282 27.0834 13.5417 27.0834ZM19.114 22.8333L19.4886 22.6082L22.8926 22.8918L22.6089 19.4879L22.8341 19.1133C23.8374 17.4442 24.375 15.5336 24.375 13.5409C24.375 7.55779 19.5247 2.70754 13.5416 2.70754C7.55854 2.70754 2.70828 7.55779 2.70828 13.5409C2.70828 19.524 7.55854 24.3742 13.5416 24.3742C15.5343 24.3742 17.4449 23.8367 19.114 22.8333ZM13.5421 20.3099C14.2902 20.3099 14.8967 19.7036 14.8967 18.9557C14.8967 18.2078 14.2902 17.6016 13.5421 17.6016C12.7939 17.6016 12.1874 18.2078 12.1874 18.9557C12.1874 19.7036 12.7939 20.3099 13.5421 20.3099ZM12.1876 16.2488H14.8959V14.8947C14.8959 14.898 14.9023 14.8909 14.9168 14.875C14.9523 14.8358 15.0366 14.743 15.1945 14.6177C15.3301 14.5101 15.3722 14.4822 15.7149 14.2649C16.8812 13.5256 17.6043 12.2399 17.6043 10.8322C17.6043 8.5885 15.7854 6.76965 13.5418 6.76965C11.2981 6.76965 9.47925 8.5885 9.47925 10.8322H12.1876C12.1876 10.0843 12.7939 9.47799 13.5418 9.47799C14.2896 9.47799 14.8959 10.0843 14.8959 10.8322C14.8959 11.3025 14.6556 11.7298 14.2648 11.9775C13.8264 12.2555 13.7536 12.3037 13.5113 12.496C12.7059 13.1349 12.1876 13.8962 12.1876 14.8947V16.2488Z" fill="#D1B59A"/>
                    </svg>
                  </span>
                </div>
                
                <p className='deliver__page-two_p'>
                Максимально точно подобрать размер мы помогаем по меркам: обхват груди, талии и бёдер. Пришлите нам свои мерки и мы в 99% случаев правильно подберем Ваш размер.
                </p>
              </div>
              <div className='deliver__page-two_blocks'>
                <div className='deliver__page-two_head'>
                  <h2 className='deliver__page-two_title'>КАК ПРИМЕРИТЬ?</h2>
                  <span>
                    <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M13.5417 27.0834C15.877 27.0834 18.1283 26.4902 20.1222 25.3795L25.8574 25.8574L25.3795 20.1222C26.4902 18.1283 27.0834 15.877 27.0834 13.5417C27.0834 6.06282 21.0206 0 13.5417 0C6.06282 0 0 6.06282 0 13.5417C0 21.0206 6.06282 27.0834 13.5417 27.0834ZM19.114 22.8333L19.4886 22.6082L22.8926 22.8918L22.6089 19.4879L22.8341 19.1133C23.8374 17.4442 24.375 15.5336 24.375 13.5409C24.375 7.55779 19.5247 2.70754 13.5416 2.70754C7.55854 2.70754 2.70828 7.55779 2.70828 13.5409C2.70828 19.524 7.55854 24.3742 13.5416 24.3742C15.5343 24.3742 17.4449 23.8367 19.114 22.8333ZM13.5421 20.3099C14.2902 20.3099 14.8967 19.7036 14.8967 18.9557C14.8967 18.2078 14.2902 17.6016 13.5421 17.6016C12.7939 17.6016 12.1874 18.2078 12.1874 18.9557C12.1874 19.7036 12.7939 20.3099 13.5421 20.3099ZM12.1876 16.2488H14.8959V14.8947C14.8959 14.898 14.9023 14.8909 14.9168 14.875C14.9523 14.8358 15.0366 14.743 15.1945 14.6177C15.3301 14.5101 15.3722 14.4822 15.7149 14.2649C16.8812 13.5256 17.6043 12.2399 17.6043 10.8322C17.6043 8.5885 15.7854 6.76965 13.5418 6.76965C11.2981 6.76965 9.47925 8.5885 9.47925 10.8322H12.1876C12.1876 10.0843 12.7939 9.47799 13.5418 9.47799C14.2896 9.47799 14.8959 10.0843 14.8959 10.8322C14.8959 11.3025 14.6556 11.7298 14.2648 11.9775C13.8264 12.2555 13.7536 12.3037 13.5113 12.496C12.7059 13.1349 12.1876 13.8962 12.1876 14.8947V16.2488Z" fill="#D1B59A"/>
                    </svg>
                  </span>
                </div>
                <p className='deliver__page-two_p'>
                  В Москве примерить все образы можно в шоуруме по адресу: Новая площадь 8 стр 2, 5 этаж, также Вы можете заказать доставку с выездным стилистом (в том числе ближайшее Подмосковье до 5 км от МКАД).
                  Примерка в регионах России возможна при получении при курьере в течение 15 минут.
                </p>
              </div>
              <div className='deliver__page-two_blocks'>
                <div className='deliver__page-two_head'>
                  <h2 className='deliver__page-two_title'>ЧТО ДЕЛАТЬ, ЕСЛИ МНЕ НЕ ПОДОЙДЕТ?</h2>
                  <span>
                    <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M13.5417 27.0834C15.877 27.0834 18.1283 26.4902 20.1222 25.3795L25.8574 25.8574L25.3795 20.1222C26.4902 18.1283 27.0834 15.877 27.0834 13.5417C27.0834 6.06282 21.0206 0 13.5417 0C6.06282 0 0 6.06282 0 13.5417C0 21.0206 6.06282 27.0834 13.5417 27.0834ZM19.114 22.8333L19.4886 22.6082L22.8926 22.8918L22.6089 19.4879L22.8341 19.1133C23.8374 17.4442 24.375 15.5336 24.375 13.5409C24.375 7.55779 19.5247 2.70754 13.5416 2.70754C7.55854 2.70754 2.70828 7.55779 2.70828 13.5409C2.70828 19.524 7.55854 24.3742 13.5416 24.3742C15.5343 24.3742 17.4449 23.8367 19.114 22.8333ZM13.5421 20.3099C14.2902 20.3099 14.8967 19.7036 14.8967 18.9557C14.8967 18.2078 14.2902 17.6016 13.5421 17.6016C12.7939 17.6016 12.1874 18.2078 12.1874 18.9557C12.1874 19.7036 12.7939 20.3099 13.5421 20.3099ZM12.1876 16.2488H14.8959V14.8947C14.8959 14.898 14.9023 14.8909 14.9168 14.875C14.9523 14.8358 15.0366 14.743 15.1945 14.6177C15.3301 14.5101 15.3722 14.4822 15.7149 14.2649C16.8812 13.5256 17.6043 12.2399 17.6043 10.8322C17.6043 8.5885 15.7854 6.76965 13.5418 6.76965C11.2981 6.76965 9.47925 8.5885 9.47925 10.8322H12.1876C12.1876 10.0843 12.7939 9.47799 13.5418 9.47799C14.2896 9.47799 14.8959 10.0843 14.8959 10.8322C14.8959 11.3025 14.6556 11.7298 14.2648 11.9775C13.8264 12.2555 13.7536 12.3037 13.5113 12.496C12.7059 13.1349 12.1876 13.8962 12.1876 14.8947V16.2488Z" fill="#D1B59A"/>
                    </svg>
                  </span>
                </div>
                <p className='deliver__page-two_p'>
                В случае если что-то не подходит, мы за свой счёт делаем замену размера, возврат клиент осуществляет до нашего офиса самостоятельно, возврат денежных средств происходит в течение 3-х дней на карту с которой была произведена оплата.
                </p>
              </div>
            </div>
            <div className='deliver__questions'>
              <div className='deliver__questions-block'>
                <img className='deliver__questions-icon' src={icon} alt="icon"/>
                <h2 className='deliver__questions-title'>ЗАДАТЬ ВОПРОС</h2>
                <form className='deliver__questions-form'>
                  <div className='deliver__questions-object'><input className='deliver__questions-object_inp' type="text" placeholder='Введите имя' required/></div>
                  <div className='deliver__questions-object'><input className='deliver__questions-object_inp' type="number" placeholder='Введите номер' required/></div>
                  <div className='deliver__questions-object'><input className='deliver__questions-object_inp' type="email" placeholder='Введите свой email' required/></div>
                  <textarea className='deliver__questions-object_textarea' name="textArea" id="" data-minLength="5" rows="3" placeholder='Сообщение'></textarea>
                  <button className='deliver__questions-btn' type='submit'>Отправить</button>
                </form>
              </div>
            </div>
        </div>
    </section>
  )
}

export default Voz